src/Documents/ПеремаркировкаТоваровИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПеремаркировкаТоваровИСМП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяИндивидуализацияКИЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяХарактеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйКодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокументаСертификации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовОбязательнойСертификацииИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаСертификации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаСертификации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПеремаркировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныПеремаркировкиТоваровИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВводаВОборот</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПервичногоДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПервичныхДокументовИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроизводства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьМаркировкаОстатков</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СтатусыДокументовИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиВозвратаВОборотИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПеремаркировкиТоваровИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиВыводаИзОборотаИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПриемкиТоваровИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиСписанияКодовМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПодключениеКОборудованиюРозливаИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиОтчетаИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиОтгрузкиТоваровИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиУточненияСведенийОКодахМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиМаркировкиТоваровИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремаркировкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеКодовМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодключениеКегаКОборудованиюРозливаИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратВОборотИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводИзОборотаИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.УточнениеСведенийОКодахМаркировкиИСМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМолочнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыОбработкиПеремаркировкиТоваровИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиПеремаркировкиТоваровИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаКодовМаркировкиКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаКодовМаркировкиОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокировкаКодовМаркировкиОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодыМаркировкиЗаблокированыДляПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремаркировкаКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремаркировкаОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремаркировкаОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремаркировкаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуализацияКИЗКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуализацияКИЗОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуализацияКИЗОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуализацияКИЗВыполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПричиныПеремаркировкиТоваровИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныПеремаркировкиТоваровИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспорченоУтрачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкиОписанияТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтРозничногоПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВСлучаеДистанционнойПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровПриобретенныхНеДляПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремаркировкаТоваровИСМП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ТребуетсяИндивидуализацияКИЗ
		И ВидПродукции <> Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		ТребуетсяИндивидуализацияКИЗ = Ложь;
	КонецЕсли;
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ЭтоНовый") Или Не ДополнительныеСвойства.ЭтоНовый Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Документ", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Статусы.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыДокументовИСМП КАК Статусы
		|ГДЕ
		|	Статусы.Документ = &Документ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Статус = Перечисления.СтатусыОбработкиПеремаркировкиТоваровИСМП.Черновик Тогда
				ДополнительныеСвойства.Вставить("ТребуетсяПерезаписьСтатусаПоУмолчанию", Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ИнтеграцияИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
	НепроверяемыеРеквизиты.Добавить("Товары.Характеристика");
	НепроверяемыеРеквизиты.Добавить("Товары.КодМаркировки");
	
	НепроверяемыеРеквизиты.Добавить("Товары.НоваяХарактеристика");
	НепроверяемыеРеквизиты.Добавить("Товары.НовыйКодМаркировки");
	НепроверяемыеРеквизиты.Добавить("Товары.КодТНВЭД");
	
	ШаблонСообщения = НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""Товары""'");
	
	ТаблицаТовары = Товары.Выгрузить();
	ТаблицаТовары.Колонки.Добавить("ХарактеристикиИспользуются",      Новый ОписаниеТипов("Булево"));
	ТаблицаТовары.Колонки.Добавить("НоваяХарактеристикаИспользуется", Новый ОписаниеТипов("Булево"));

	ИнтеграцияИСПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(Неопределено, ТаблицаТовары);
	
	Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
		НомерСтроки = СтрокаТовары.НомерСтроки;
		
		Если СтрокаТовары.ПричинаПеремаркировки = ПредопределенноеЗначение(
			"Перечисление.ПричиныПеремаркировкиТоваровИСМП.ОшибкиОписанияТовара") Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
				ТекстОшибки = СтрШаблон(ШаблонСообщения, НСтр("ru = 'Номенклатура (старая)'"), НомерСтроки);
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", НомерСтроки, "Номенклатура"),,
					Отказ);
			КонецЕсли;
				
			Если Не ЗначениеЗаполнено(СтрокаТовары.КодМаркировки) Тогда
				ТекстОшибки = СтрШаблон(ШаблонСообщения, НСтр("ru = 'Код маркировки (старый)'"), НомерСтроки);
				
				ОбщегоНазначения.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", НомерСтроки, "КодМаркировки"),,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаТовары.ХарактеристикиИспользуются
			И Не ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
			ТекстОшибки = СтрШаблон(ШаблонСообщения, НСтр("ru = 'Характеристика (старая)'"), НомерСтроки);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Товары", НомерСтроки, "Характеристика"),,
				Отказ);
		КонецЕсли;
		
		Если СтрокаТовары.НоваяХарактеристикаИспользуется
			И Не ЗначениеЗаполнено(СтрокаТовары.НоваяХарактеристика) Тогда
			ТекстОшибки = СтрШаблон(ШаблонСообщения, НСтр("ru = 'Характеристика (новая)'"), НомерСтроки);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Товары", НомерСтроки, "НоваяХарактеристика"),,
				Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование   = Неопределено;
	ИдентификаторЗаявки = Неопределено;
	Товары.Очистить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияПеремаркировкиТоваровИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
